# Importing Required Libraries

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Loading the Dataset

In [2]:
data = pd.read_csv('../merged_file.csv')
data.head()

               DATE  B.FAST  LUNCH  Snacks   DINNER
0  01-05-2023 00:00   111.0  195.0   108.0    137.0
1  02-05-2023 00:00    95.0  175.0   115.0    138.0
2  03-05-2023 00:00    95.0  203.0   129.0    134.0
3  04-05-2023 00:00    93.0  184.0   131.0    179.0
4  05-05-2023 00:00   112.0  121.0    95.0    117.0

In [3]:
len(data)

99

In [4]:
# changing the column names to lower case
data.columns = data.columns.str.lower()

In [5]:
def format_columns(data):
    data.columns = data.columns.str.lower()
    data.rename(columns={'b.fast':'breakfast'}, inplace=True)
    return data

In [6]:
data = format_columns(data)
data.head()

               date  breakfast  lunch  snacks   dinner
0  01-05-2023 00:00      111.0  195.0   108.0    137.0
1  02-05-2023 00:00       95.0  175.0   115.0    138.0
2  03-05-2023 00:00       95.0  203.0   129.0    134.0
3  04-05-2023 00:00       93.0  184.0   131.0    179.0
4  05-05-2023 00:00      112.0  121.0    95.0    117.0

In [9]:
# getting all rows with null values
null_rows = data[data.isnull().any(axis=1)]
null_rows

   date  breakfast  lunch  snacks   dinner
92  NaN        NaN    NaN     NaN      NaN
93  NaN        NaN    NaN     NaN      NaN
94  NaN        NaN    NaN     NaN      NaN
95  NaN        NaN    NaN     NaN      NaN
96  NaN        NaN    NaN     NaN      NaN
97  NaN        NaN    NaN     NaN      NaN
98             NaN    NaN     NaN      NaN

In [11]:
# removing null rows
data = data.dropna()
data.tail()

                date  breakfast  lunch  snacks   dinner
87  27-07-2023 00:00       37.0   51.0    33.0     54.0
88  28-07-2023 00:00       48.0   68.0    44.0     59.0
89  29-07-2023 00:00       45.0   39.0    34.0     48.0
90  30-07-2023 00:00       49.0   37.0    40.0     43.0
91  31-07-2023 00:00       44.0   51.0    37.0     36.0